# Чек-лист Sprint-8

Экран «Список плейлистов» и создание нового плейлиста
- ✅  На экране плейлистов отображается список созданных плейлистов.
- ✅  Каждый плейлист показывает название и количество треков.
- ✅  Есть FloatingActionButton для добавления нового плейлиста.
- ✅  Экран создания плейлиста позволяет ввести имя и описание, сохранить результат.
- ✅  После сохранения новый плейлист появляется в списке.
- ✅  При нажатии на плейлист открывается экран Playlist details.
Экран деталей трека
- ✅  Экран деталей трека открывается по клику на трек в поиске.
- ✅  На экране отображается название, исполнитель, время и обложка.
- ✅  Есть иконка «Добавить в избранное» (работает переключение).
- ✅  Есть иконка «Добавить в плейлист» — открывается BottomSheet со списком плейлистов.