Чек-лист самопроверки
После рефакторинга приложение выглядит и работает в соответствии с дизайном и установленными ранее функциональными требованиями.
Реализован функционал:
Экран поиска
Плейсхолдер (нет результатов). Если в результате успешного выполнения поискового API запроса не было найдено ни одной аудиозаписи, то на экране «Поиск» отображается изображение-заглушка с сообщением, что поиск не дал результатов (результат поискового запроса пустой).
Плейсхолдер (ошибка сервера). Если поисковый API запрос завершился неудачно (в ответе от сервера присутствует код ошибки), то на экране «Поиск» отображаются изображение-заглушка с сообщением, что на сервере произошла ошибка, и кнопка «Обновить».
Нажатие на кнопку «Обновить». Если на экране «Поиск» отображается плейсхолдер с кнопкой «Обновить», то после того как пользователь нажмёт на эту кнопку, приложение должно выполнить последний неудавшийся поисковый API запрос.
Непустой результат запроса. Если в результате успешного выполнения поискового API запроса сервер вернул хотя бы одну песню (результат запроса непустой), то на экране «Поиск» отображается список результатов поискового запроса.
Элемент списка результатов. Когда от сервера получен непустой результат поискового запроса, то на экране «Поиск» отображается список треков и пользователь видит элементы списка, каждый из которых имеет:
область для отображения обложки;
название трека (значение параметра trackName);
имя исполнителя (значение параметра artistName);
продолжительность трека в формате mm:ss (отформатированное значение параметра trackTimeMillis).
В качестве изображения обложки следует использовать изображение, находящееся по ссылке параметра artworkUrl100.
Плейсхолдер обложки трека. Если трек не имеет изображения обложки, то на элементе списка треков в области отображения обложки пользователь должен видеть изображение-заглушку.
Если трек имеет изображение обложки, но оно ещё не загружено, то пользователь также должен видеть изображение-заглушку в области отображения обложки.
Изображение обложки трека. Если трек имеет изображение обложки и оно загружено приложением, то пользователь должен видеть это изображение в области для отображения обложки.
Нажатие на кнопку «Очистить поисковый запрос». Если пользователь находится на экране «Поиск», поисковый запрос непустой, на экране отображается список треков, пользователь видит кнопку «Очистить поисковый запрос» в поле ввода поискового запроса, то при нажатии на эту кнопку поисковый запрос очищается, клавиатура прячется, а кнопка (x) и список треков исчезают.
Экран плейлиста
Размер и расположение элементов на экране соответствует дизайн-макету из Figma.
Отображаются данные:
название плейлиста,
описание плейлиста,
список треков.
Реализована корректная навигация между экранами:
При нажатии на плейлист на экране списка плейлистов пользователь переходит на экран плейлиста.
При нажатии системной кнопки «Назад» пользователь возвращается на экран списка.